:PROPERTIES:
:ID:       83061ba0-e6f5-41c3-ba91-a0a00b2548f4
:END:
#+title: linux-tool-kill
#+date: [2024-07-05 五]
#+last_modified: [2024-07-05 五 18:01]

* Use SIGNO 9(SIGKILL) to END Proc
#+HEADER: :var pid=999999
#+BEGIN_SRC sh
  kill -9 $pid
#+END_SRC

#+RESULTS:
: 999999


* Use SIGNO 15(SIGTERM) to END Proc
#+HEADER: :var pid=99999
#+BEGIN_SRC sh
kill -15 $pid
#+END_SRC

#+RESULTS:


* Show All Available Sigals

#+BEGIN_SRC sh :results list
  kill -l
#+END_SRC


